In [1]:
import pandas as pd

C:\Users\user\AppData\Local\Temp\ipykernel_13112\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.read_csv('../../data_folder/newyork1.csv')

In [3]:
df

        day  temprature  windspeed   event
0  01/01/17        32.0        6.0     NaN
1  01/04/17         NaN        9.0   Sunny
2  01/05/17        28.0        NaN    Snow
3  01/06/17         NaN        7.0     NaN
4  01/07/17        32.0        NaN    Rain
5  01/08/17         NaN        NaN   Sunny
6  01/09/17         NaN        NaN     NaN
7  01/10/17        34.0        8.0  Cloudy
8  01/11/17        40.0       12.0   Sunny

In [4]:
#code to return type of a day column first value
type(df['day'][0])

str

In [5]:
#code to convert day column data into day and read
df = pd.read_csv('../../data_folder/newyork1.csv', parse_dates=['day'])

C:\Users\user\AppData\Local\Temp\ipykernel_13112\331829856.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv('../../data_folder/newyork1.csv', parse_dates=['day'])

In [6]:
df

         day  temprature  windspeed   event
0 2017-01-01        32.0        6.0     NaN
1 2017-01-04         NaN        9.0   Sunny
2 2017-01-05        28.0        NaN    Snow
3 2017-01-06         NaN        7.0     NaN
4 2017-01-07        32.0        NaN    Rain
5 2017-01-08         NaN        NaN   Sunny
6 2017-01-09         NaN        NaN     NaN
7 2017-01-10        34.0        8.0  Cloudy
8 2017-01-11        40.0       12.0   Sunny

In [7]:
type(df['day'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [8]:
df

         day  temprature  windspeed   event
0 2017-01-01        32.0        6.0     NaN
1 2017-01-04         NaN        9.0   Sunny
2 2017-01-05        28.0        NaN    Snow
3 2017-01-06         NaN        7.0     NaN
4 2017-01-07        32.0        NaN    Rain
5 2017-01-08         NaN        NaN   Sunny
6 2017-01-09         NaN        NaN     NaN
7 2017-01-10        34.0        8.0  Cloudy
8 2017-01-11        40.0       12.0   Sunny

In [9]:
df.set_index(day, inplace=True)

NameError: name 'day' is not defined

In [10]:
df.set_index('day', inplace=True)

In [11]:
df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-09         NaN        NaN     NaN
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [12]:
df.reset_index()

         day  temprature  windspeed   event
0 2017-01-01        32.0        6.0     NaN
1 2017-01-04         NaN        9.0   Sunny
2 2017-01-05        28.0        NaN    Snow
3 2017-01-06         NaN        7.0     NaN
4 2017-01-07        32.0        NaN    Rain
5 2017-01-08         NaN        NaN   Sunny
6 2017-01-09         NaN        NaN     NaN
7 2017-01-10        34.0        8.0  Cloudy
8 2017-01-11        40.0       12.0   Sunny

In [13]:
df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-09         NaN        NaN     NaN
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [14]:
df.reset_index(inplace=True)

In [15]:
df

         day  temprature  windspeed   event
0 2017-01-01        32.0        6.0     NaN
1 2017-01-04         NaN        9.0   Sunny
2 2017-01-05        28.0        NaN    Snow
3 2017-01-06         NaN        7.0     NaN
4 2017-01-07        32.0        NaN    Rain
5 2017-01-08         NaN        NaN   Sunny
6 2017-01-09         NaN        NaN     NaN
7 2017-01-10        34.0        8.0  Cloudy
8 2017-01-11        40.0       12.0   Sunny

In [17]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I']

In [18]:
df

         day  temprature  windspeed   event
A 2017-01-01        32.0        6.0     NaN
B 2017-01-04         NaN        9.0   Sunny
C 2017-01-05        28.0        NaN    Snow
D 2017-01-06         NaN        7.0     NaN
E 2017-01-07        32.0        NaN    Rain
F 2017-01-08         NaN        NaN   Sunny
G 2017-01-09         NaN        NaN     NaN
H 2017-01-10        34.0        8.0  Cloudy
I 2017-01-11        40.0       12.0   Sunny

In [19]:
df.index = df['day']

In [20]:
df

                  day  temprature  windspeed   event
day
2017-01-01 2017-01-01        32.0        6.0     NaN
2017-01-04 2017-01-04         NaN        9.0   Sunny
2017-01-05 2017-01-05        28.0        NaN    Snow
2017-01-06 2017-01-06         NaN        7.0     NaN
2017-01-07 2017-01-07        32.0        NaN    Rain
2017-01-08 2017-01-08         NaN        NaN   Sunny
2017-01-09 2017-01-09         NaN        NaN     NaN
2017-01-10 2017-01-10        34.0        8.0  Cloudy
2017-01-11 2017-01-11        40.0       12.0   Sunny

In [21]:
# code to set the index of a dataframe as some column data.
df.set_index('day', inplace=True)

In [22]:
df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-09         NaN        NaN     NaN
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [23]:
# code to fill the value with zero where null value is there in the entire df.
df.fillna(0)

            temprature  windspeed   event
day
2017-01-01        32.0        6.0       0
2017-01-04         0.0        9.0   Sunny
2017-01-05        28.0        0.0    Snow
2017-01-06         0.0        7.0       0
2017-01-07        32.0        0.0    Rain
2017-01-08         0.0        0.0   Sunny
2017-01-09         0.0        0.0       0
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [24]:
df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-09         NaN        NaN     NaN
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [25]:
#code to fill the na value with some other value based on the column names.
new_df = df.fillna({
    'temprature': 0,
    'windspeed': 0,
    'event': 'No event'
})

In [26]:
new_df

            temprature  windspeed     event
day
2017-01-01        32.0        6.0  No event
2017-01-04         0.0        9.0     Sunny
2017-01-05        28.0        0.0      Snow
2017-01-06         0.0        7.0  No event
2017-01-07        32.0        0.0      Rain
2017-01-08         0.0        0.0     Sunny
2017-01-09         0.0        0.0  No event
2017-01-10        34.0        8.0    Cloudy
2017-01-11        40.0       12.0     Sunny

In [27]:
# code to fill the na value with just forward value means one value above.
new_df = df.fillna(method='ffill')

C:\Users\user\AppData\Local\Temp\ipykernel_13112\2070235967.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method='ffill')

In [28]:
new_df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04        32.0        9.0   Sunny
2017-01-05        28.0        9.0    Snow
2017-01-06        28.0        7.0    Snow
2017-01-07        32.0        7.0    Rain
2017-01-08        32.0        7.0   Sunny
2017-01-09        32.0        7.0   Sunny
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [29]:
# code to fill the na value with just next day value.
new_df = df.fillna(method='bfill')

C:\Users\user\AppData\Local\Temp\ipykernel_13112\2882844077.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method='bfill')

In [30]:
new_df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0   Sunny
2017-01-04        28.0        9.0   Sunny
2017-01-05        28.0        7.0    Snow
2017-01-06        32.0        7.0    Rain
2017-01-07        32.0        8.0    Rain
2017-01-08        34.0        8.0   Sunny
2017-01-09        34.0        8.0  Cloudy
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [31]:
# code to copy data from next column at the place of na
new_df = df.fillna(method='bfill', axis=1)

C:\Users\user\AppData\Local\Temp\ipykernel_13112\4057796040.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method='bfill', axis=1)
C:\Users\user\AppData\Local\Temp\ipykernel_13112\4057796040.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_df = df.fillna(method='bfill', axis=1)

In [32]:
new_df

           temprature windspeed   event
day
2017-01-01       32.0       6.0     NaN
2017-01-04        9.0       9.0   Sunny
2017-01-05       28.0      Snow    Snow
2017-01-06        7.0       7.0     NaN
2017-01-07       32.0      Rain    Rain
2017-01-08      Sunny     Sunny   Sunny
2017-01-09        NaN       NaN     NaN
2017-01-10       34.0       8.0  Cloudy
2017-01-11       40.0      12.0   Sunny

In [33]:
# same things
new_df = df.fillna(method='bfill', axis='columns')

C:\Users\user\AppData\Local\Temp\ipykernel_13112\3476166004.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method='bfill', axis='columns')
C:\Users\user\AppData\Local\Temp\ipykernel_13112\3476166004.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_df = df.fillna(method='bfill', axis='columns')

In [34]:
new_df

           temprature windspeed   event
day
2017-01-01       32.0       6.0     NaN
2017-01-04        9.0       9.0   Sunny
2017-01-05       28.0      Snow    Snow
2017-01-06        7.0       7.0     NaN
2017-01-07       32.0      Rain    Rain
2017-01-08      Sunny     Sunny   Sunny
2017-01-09        NaN       NaN     NaN
2017-01-10       34.0       8.0  Cloudy
2017-01-11       40.0      12.0   Sunny

In [35]:
# we can add limit also while copying data from prev or next.
new_df = df.fillna(method='ffill', limit=1)

C:\Users\user\AppData\Local\Temp\ipykernel_13112\2568760181.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_df = df.fillna(method='ffill', limit=1)

In [36]:
new_df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04        32.0        9.0   Sunny
2017-01-05        28.0        9.0    Snow
2017-01-06        28.0        7.0    Snow
2017-01-07        32.0        7.0    Rain
2017-01-08        32.0        NaN   Sunny
2017-01-09         NaN        NaN   Sunny
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [37]:
new_df

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04        32.0        9.0   Sunny
2017-01-05        28.0        9.0    Snow
2017-01-06        28.0        7.0    Snow
2017-01-07        32.0        7.0    Rain
2017-01-08        32.0        NaN   Sunny
2017-01-09         NaN        NaN   Sunny
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [40]:
# code to fill the value between prev and next in the place of na.
new_df = df.interpolate()

C:\Users\user\AppData\Local\Temp\ipykernel_13112\2727307478.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df = df.interpolate()

In [41]:
new_df

            temprature  windspeed   event
day
2017-01-01   32.000000       6.00     NaN
2017-01-04   30.000000       9.00   Sunny
2017-01-05   28.000000       8.00    Snow
2017-01-06   30.000000       7.00     NaN
2017-01-07   32.000000       7.25    Rain
2017-01-08   32.666667       7.50   Sunny
2017-01-09   33.333333       7.75     NaN
2017-01-10   34.000000       8.00  Cloudy
2017-01-11   40.000000      12.00   Sunny

In [42]:
# code to interpolate in terms of time.
new_df = df.interpolate(method='time')

C:\Users\user\AppData\Local\Temp\ipykernel_13112\3425673404.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  new_df = df.interpolate(method='time')

In [43]:
new_df

            temprature  windspeed   event
day
2017-01-01   32.000000       6.00     NaN
2017-01-04   29.000000       9.00   Sunny
2017-01-05   28.000000       8.00    Snow
2017-01-06   30.000000       7.00     NaN
2017-01-07   32.000000       7.25    Rain
2017-01-08   32.666667       7.50   Sunny
2017-01-09   33.333333       7.75     NaN
2017-01-10   34.000000       8.00  Cloudy
2017-01-11   40.000000      12.00   Sunny

In [44]:
# code to drop the rows having atleast one na value is there.
df.dropna()

            temprature  windspeed   event
day
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [45]:
# code to drop the rows having all the value will be null
df.dropna(how="all")

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [46]:
# code to keep that rows having alteast one non na value else drop
df.dropna(thresh=1)

            temprature  windspeed   event
day
2017-01-01        32.0        6.0     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny

In [47]:
new_df

            temprature  windspeed   event
day
2017-01-01   32.000000       6.00     NaN
2017-01-04   29.000000       9.00   Sunny
2017-01-05   28.000000       8.00    Snow
2017-01-06   30.000000       7.00     NaN
2017-01-07   32.000000       7.25    Rain
2017-01-08   32.666667       7.50   Sunny
2017-01-09   33.333333       7.75     NaN
2017-01-10   34.000000       8.00  Cloudy
2017-01-11   40.000000      12.00   Sunny

In [48]:
# code to keep those rows having atleast two non na value else drop
new_df.dropna(thresh=2)

            temprature  windspeed   event
day
2017-01-01   32.000000       6.00     NaN
2017-01-04   29.000000       9.00   Sunny
2017-01-05   28.000000       8.00    Snow
2017-01-06   30.000000       7.00     NaN
2017-01-07   32.000000       7.25    Rain
2017-01-08   32.666667       7.50   Sunny
2017-01-09   33.333333       7.75     NaN
2017-01-10   34.000000       8.00  Cloudy
2017-01-11   40.000000      12.00   Sunny

In [49]:
# code to add those rows which are missing day 2nd and 3rd
dt = pd.date_range('01-01-2017', '01-11-2017')

In [50]:
dt

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11'],
              dtype='datetime64[ns]', freq='D')

In [51]:
idx = pd.DatetimeIndex(dt)

In [52]:
idx

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11'],
              dtype='datetime64[ns]', freq='D')

In [53]:
df = df.reindex(idx)

In [54]:
df

            temprature  windspeed   event
2017-01-01        32.0        6.0     NaN
2017-01-02         NaN        NaN     NaN
2017-01-03         NaN        NaN     NaN
2017-01-04         NaN        9.0   Sunny
2017-01-05        28.0        NaN    Snow
2017-01-06         NaN        7.0     NaN
2017-01-07        32.0        NaN    Rain
2017-01-08         NaN        NaN   Sunny
2017-01-09         NaN        NaN     NaN
2017-01-10        34.0        8.0  Cloudy
2017-01-11        40.0       12.0   Sunny